# include<stdio.h>
# include"student.h"
void search_boot()//查询菜单
{
	PR("       ┏━━━━━━━━━━━━━━━━━┓\n"); 
	PR("       ┃   <0>--------查询完毕            ┃\n"); 
	PR("       ┃   <1>--------按学号查询          ┃\n");
	PR("       ┃   <2>--------按姓名查询          ┃\n"); 
	PR("       ┃   <3>--------按数据结构成绩查询  ┃\n"); 
	PR("       ┃   <4>--------按汇编语言成绩查询  ┃\n");
	PR("       ┃   <5>--------按网络基础成绩查询  ┃\n");
	PR("       ┃   <6>--------按总分查询          ┃\n");
	PR("       ┃   <7>--------按平均分查询        ┃\n");
	PR("       ┗━━━━━━━━━━━━━━━━━┛\n");
}