# include<stdio.h>
# include"student.h"
void show_boot()//显示菜单
{
	PR("       ┏━━━━━━━━━━━━━━━━━━━━━━━━━━━┓\n");
	PR("       ┃ <0>------显示完毕                                    ┃\n");
	PR("       ┃ <1>------按总分递减排序(插入排序)                    ┃\n");
	PR("       ┃ <2>------按平均分递减排序(选择排序)                  ┃\n");
	PR("       ┃ <3>------按学号递减排序(快速排序)                    ┃\n");
	PR("       ┃ <4>------按数据结构成绩递减排序(冒泡排序)            ┃\n");
	PR("       ┃ <5>------按汇编语言成绩递减排序(堆排序)              ┃\n");
	PR("       ┃ <6>------按网络基础成绩递减排序(希尔排序)            ┃\n");
	PR("       ┗━━━━━━━━━━━━━━━━━━━━━━━━━━━┛\n");
}